a = int(input("Въведи първото число: ")) #Въвеждаме a от конзолата
b = int(input("Въведи второто число: ")) #Въвеждаме b от конзолата

def nod (m,n): #Дефинираме фукнцция с клччовата дума def и давааме име и параметри
    if m < n: #Правим условие докато m е по-малко от n
        (m, n) = (n, m) # Тук казваме, че m и n ще бъдат равни на n и m
    if(m % n) == 0: # '%' в питон значи остатък – дели левия операнд на десния и връща остатък ,а == е присвояване
        return n # връща n
    else: #Условие
        return (nod (n, m % n)) #връяа ни НОД, като дели m на n и ни връща остатъка
print('Най-големият общ делител е: ')
print(nod (a, b )) # изкарва резултата в конзолата